In [1]:
import pandas as pd

In [2]:
df_track = pd.read_csv(r'c:\Users\labsfiap\Downloads\Track_202408231953.csv')

In [3]:
df_track.groupby('Name')['Milliseconds'].sum()

Name
"40"                                                           157962
"?"                                                           2782333
"Eine Kleine Nachtmusik" Serenade In G, K. 525: I. Allegro     348971
#1 Zero                                                        299102
#9 Dream                                                       278312
                                                               ...
É que Nessa Encarnação Eu Nasci Manga                          196519
Étude 1, In C Major - Preludio (Presto) - Liszt                 51780
Óculos                                                         219271
Óia Eu Aqui De Novo                                            219454
Último Pau-De-Arara                                            200437
Name: Milliseconds, Length: 3257, dtype: int64

In [4]:
df_track

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,For Those About To Rock (We Salute You),1,1,1,"Angus Young, Malcolm Young, Brian Johnson",343719,11170334,0.99
1,2,Balls to the Wall,2,2,1,NaN,342562,5510424,0.99
2,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,4,Restless and Wild,3,2,1,"F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. D...",252051,4331779,0.99
4,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99
...,...,...,...,...,...,...,...,...,...
3498,3499,Pini Di Roma (Pinien Von Rom) \ I Pini Della V...,343,2,24,NaN,286741,4718950,0.99
3499,3500,"String Quartet No. 12 in C Minor, D. 703 ""Quar...",344,2,24,Franz Schubert,139200,2283131,0.99
3500,3501,"L'orfeo, Act 3, Sinfonia (Orchestra)",345,2,24,Claudio Monteverdi,66639,1189062,0.99
3501,3502,"Quintet for Horn, Violin, 2 Violas, and Cello ...",346,2,24,Wolfgang Amadeus Mozart,221331,3665114,0.99
3502,3503,Koyaanisqatsi,347,2,10,Philip Glass,206005,3305164,0.99

In [5]:
df_track["Milliseconds"]

0       343719
1       342562
2       230619
3       252051
4       375418
         ...
3498    286741
3499    139200
3500     66639
3501    221331
3502    206005
Name: Milliseconds, Length: 3503, dtype: int64

In [6]:
import numpy as np

In [7]:
vetor = np.array([10,20,30,40,50])

In [8]:
matriz_2d = np.array([[10, 20], [4, 5], [100, 200]])
matriz_2d

array([[ 10,  20],
       [  4,   5],
       [100, 200]])

In [9]:
vetor

array([10, 20, 30, 40, 50])

In [10]:
#Estruturas unidimensionais =  pandas series

s1 = pd.Series([10,20,30,40,50])
s2 = pd.Series([1,2,3,4,5])

s_soma = s1 + s2
s_sub = s1 +- s2
s_multi = s1 * s2
s_div = s1 / s2
print(s_soma)
print(s_sub)
print(s_multi)
print(s_div)

0    11
1    22
2    33
3    44
4    55
dtype: int64
0     9
1    18
2    27
3    36
4    45
dtype: int64
0     10
1     40
2     90
3    160
4    250
dtype: int64
0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [11]:
s1 = pd.Series([10,20,30,40,50], name = "Series 1")
s2 = pd.Series([1,2,3,4,5], name = "Series 2")
print(s1)
print(s2)

0    10
1    20
2    30
3    40
4    50
Name: Series 1, dtype: int64
0    1
1    2
2    3
3    4
4    5
Name: Series 2, dtype: int64

In [12]:
df = pd.DataFrame({'Serie 1': s1, 'Serie 2': s2})
df

   Serie 1  Serie 2
0       10        1
1       20        2
2       30        3
3       40        4
4       50        5

In [13]:

s1 = pd.Series([10,20,30,40,50], name = "Series 1")
s2 = pd.Series([1,2,3,4,5], name = "Series 2")
s3 = pd.Series(['A', 'B', 'C', 'B', 'A'], name = "Series 3")

df = pd.DataFrame({'Serie 1': s1, 'Serie 2': s2, 'Serie 3': s3})

df['soma'] = df['Serie 1'] + df["Serie 2" ]
df['sub'] = df['Serie 1'] - df["Serie 2" ]
df

   Serie 1  Serie 2 Serie 3  soma  sub
0       10        1       A    11    9
1       20        2       B    22   18
2       30        3       C    33   27
3       40        4       B    44   36
4       50        5       A    55   45

In [15]:
df.groupby("Serie 3")['soma'].max()
df.groupby("Serie 3")['soma'].min()
df.groupby("Serie 3")['soma'].mean()
df.groupby("Serie 3")['soma'].median()
df.groupby("Serie 3")['soma'].std()

Serie 3
A    31.112698
B    15.556349
C          NaN
Name: soma, dtype: float64

In [16]:
num = pd.Series([1,2,3,4,5,6,7,8,9,10], name = "Numero")
num[2]

3

# Exercícios 1 e 2
Crie uma Pandas Series com números de 1 a 10.
Acesse o terceiro elemento da Pandas Series e imprima seu valor.

In [18]:
numeros = pd.Series(range(1,11), name = "Numeros")
numeros[2]

3

# Exercício 3
Some duas Pandas Series contendo números de 1 a 5 e os números de 6 a 10, respectivamente.

In [49]:
numeros1 = pd.Series(range(1,6))
numeros2 = pd.Series(range(6,11))

df = pd.DataFrame({'Serie 1': numeros1, 'Serie 2': numeros2})
df['soma'] = df['Serie 1'] + df["Serie 2" ]
df

   Serie 1  Serie 2  soma
0        1        6     7
1        2        7     9
2        3        8    11
3        4        9    13
4        5       10    15

# Exercício 4
Crie uma Pandas Series contendo números de 1 a 10 e exiba apenas os valores maiores que 5

In [50]:
num = pd.Series(range(1,11))

# Atribui a S só os números maiores que 5
s = num[num>5]
s

5     6
6     7
7     8
8     9
9    10
dtype: int64

# Exercício 5
Calcule a média e o desvio padrão de uma Pandas Series contendo os números de 1 a 10.

In [52]:
num = pd.Series(range(1,11))
media = num.mean()
desvio = num.std()

print(f"Media: ",media)
print(f"Desvio Padrão: ",desvio)

Media:  5.5
Desvio Padrão:  3.0276503540974917

# Exercício 6
Concatene duas Pandas Series contendo os números de 1 a 5 e 6 a 10, respectivamente, em uma única Series.

In [40]:
menores = pd.Series(range(1,6), name = "menores")
maiores = pd.Series(range(6,11), name = "maiores")

# axis = 1 significa que é para concatenar por colunas
s_concat = pd.concat([menores,maiores], axis = 1)
s_concat

   menores  maiores
0        1        6
1        2        7
2        3        8
3        4        9
4        5       10

# Exercício 7
Subtraia uma Pandas Series contendo os números de 1 a 10 por outra Series contendo os números de 10 a 1.

In [43]:
cresc = pd.Series(range(1,11))
decresc = pd.Series(range(10,1,-1))

s_sub = cresc - decresc
s_sub

0   -9.0
1   -7.0
2   -5.0
3   -3.0
4   -1.0
5    1.0
6    3.0
7    5.0
8    7.0
9    NaN
dtype: float64

# Exercício 8
Ordene uma Pandas Series em ordem decrescente.

In [45]:
num = pd.Series(range(1,11))
# True é crescente, False é decrescente
num.sort_values(ascending = False)
num

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Exercício 9
Verifique se há valores duplicados em uma Pandas Series contendo os números de 1 a 10.

In [46]:
s1 = pd.Series([10,20,20,30,40,50,50], name = "Serie 1")
# Mostra todos e fala se tem duplicado ou não
s1.duplicated()

# Mostra se tem algum duplicado
s1.duplicated().any()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
Name: Serie 1, dtype: bool

# Exercício 10
Utilize slicing para selecionar elementos de uma Pandas Series do terceiro ao sétimo elemento.

In [48]:
num = pd.Series(range(1,11))
# Do índice 3 ao 8
num[3:8]

3    4
4    5
5    6
6    7
7    8
dtype: int64